{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "f93497f9",
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext autoreload\n",
    "%autoreload 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "6e0a703f",
   "metadata": {},
   "outputs": [],
   "source": [
    "import tqdm\n",
    "import sys\n",
    "import os"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "f6f52dbe",
   "metadata": {},
   "outputs": [],
   "source": [
    "sys.path.append('.')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "716b696c",
   "metadata": {},
   "outputs": [],
   "source": [
    "from utils.datasets import SimpleSet\n",
    "from utils.dbs import FusekiDB\n",
    "from pathlib import Path\n",
    "from rdflib.plugins.stores.sparqlstore import SPARQLStore\n",
    "import rdflib"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "30d37961",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2026-03-04 10:53:49,071 - INFO - Building docker image jena-datatensor from ../jena-datatensor\n",
      "2026-03-04 10:53:49,347 - INFO - Loading dataset into Fuseki server from ../example_dataset_and_queries/knowledge_graph/_complete.ttl\n",
      "2026-03-04 10:53:49,355 - WARNING - DB directory scratch/fuseki_test/db already exists, removing locks if any\n",
      "2026-03-04 10:53:49,360 - INFO - Stopping server with container name fuseki_benchmarks_test\n",
      "2026-03-04 10:53:49,384 - ERROR - Command failed with return code 1\n",
      "2026-03-04 10:53:49,404 - INFO - Starting Fuseki server with container name fuseki_benchmarks_test on port 3031\n",
      "2026-03-04 10:53:51,416 - INFO - Database setup complete, entering context manager\n",
      "2026-03-04 10:53:51,425 - INFO - Running SPARQL query: \n",
      "    PREFIX dt: <https://w3id.org/rdf-tensor/datatypes#>\n",
      "    PREFIX dtf: <https://w3id.org/rdf-tensor/functions#>\n",
      "    PREFIX dta: <https://w3id.org/rdf-tensor/aggregates#>\n",
      "    PREFIX ocs_papers: <https://w3id.org/ocs/ont/papers/>\n",
      "    PREFIX dcterms: <http://purl.org/dc/terms/>\n",
      "    PREFIX fabio: <http://purl.org/spar/fabio/>\n",
      "    PREFIX schema: <http://schema.org/>\n",
      "    PREFIX fn: <http://www.w3.org/2005/xpath-functions#>\n",
      "    PREFIX frbr: <http://purl.org/vocab/frbr/core#>\n",
      "\n",
      "    SELECT ?conferenceName (fn:round(?min, 3) AS ?score)  ?counted\n",
      "    WHERE {\n",
      "        {\n",
      "            SELECT ?conference ?conferenceName (dta:std(?o) AS ?stdEmbedding) (COUNT(?o) AS ?counted)\n",
      "            WHERE {\n",
      "                ?paper a fabio:ResearchPaper ;\n",
      "                    ocs_papers:hasWordEmbedding ?o ;\n",
      "                    frbr:realization ?realization .\n",
      "\n",
      "                ?realization a fabio:ConferencePaper ;\n",
      "                    frbr:partOf ?conference .\n",
      "\n",
      "                ?conference a fabio:ConferenceProceedings ;\n",
      "                    schema:name ?conferenceName .\n",
      "            }\n",
      "            GROUP BY ?conference ?conferenceName\n",
      "        }\n",
      "        BIND(dtf:min(-1, ?stdEmbedding) AS ?min)\n",
      "    }\n",
      "    ORDER BY DESC(?min)\n",
      "    LIMIT 5\n",
      "     against endpoint http://localhost:3031/test/sparql\n",
      "2026-03-04 10:53:55,265 - INFO - Exiting context manager, stopping database\n",
      "2026-03-04 10:53:55,265 - INFO - Stopping server with container name fuseki_benchmarks_test\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                                      conferenceName  score  counted\n",
      "0  Second International Conference On Research In...  0.188       47\n",
      "1  11Th International Symposium Advances In Artif...  0.188       30\n",
      "2  10Th International Symposium Advances In Artif...  0.186       28\n",
      "3  International Conference On Research In Manage...  0.185       29\n",
      "4  14Th International Workshop On Computational O...  0.179       26\n"
     ]
    }
   ],
   "source": [
    "base_set = SimpleSet(base_dir=Path(\"../example_dataset_and_queries/knowledge_graph\"))\n",
    "db = FusekiDB(\n",
    "    id=\"test\",\n",
    "    base_dir=Path(\"./scratch/fuseki_test\"),\n",
    "    build_dir=Path(\"../jena-datatensor\"),\n",
    "    dataset=base_set,\n",
    ")\n",
    "with db:\n",
    "    test_query = \"\"\"\n",
    "    PREFIX dt: <https://w3id.org/rdf-tensor/datatypes#>\n",
    "    PREFIX dtf: <https://w3id.org/rdf-tensor/functions#>\n",
    "    PREFIX dta: <https://w3id.org/rdf-tensor/aggregates#>\n",
    "    PREFIX ocs_papers: <https://w3id.org/ocs/ont/papers/>\n",
    "    PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "    PREFIX fabio: <http://purl.org/spar/fabio/>\n",
    "    PREFIX schema: <http://schema.org/>\n",
    "    PREFIX fn: <http://www.w3.org/2005/xpath-functions#>\n",
    "    PREFIX frbr: <http://purl.org/vocab/frbr/core#>\n",
    "\n",
    "    SELECT ?conferenceName (fn:round(?min, 3) AS ?score)  ?counted\n",
    "    WHERE {\n",
    "        {\n",
    "            SELECT ?conference ?conferenceName (dta:std(?o) AS ?stdEmbedding) (COUNT(?o) AS ?counted)\n",
    "            WHERE {\n",
    "                ?paper a fabio:ResearchPaper ;\n",
    "                    ocs_papers:hasWordEmbedding ?o ;\n",
    "                    frbr:realization ?realization .\n",
    "\n",
    "                ?realization a fabio:ConferencePaper ;\n",
    "                    frbr:partOf ?conference .\n",
    "\n",
    "                ?conference a fabio:ConferenceProceedings ;\n",
    "                    schema:name ?conferenceName .\n",
    "            }\n",
    "            GROUP BY ?conference ?conferenceName\n",
    "        }\n",
    "        BIND(dtf:min(-1, ?stdEmbedding) AS ?min)\n",
    "    }\n",
    "    ORDER BY DESC(?min)\n",
    "    LIMIT 5\n",
    "    \"\"\"\n",
    "    results = db.query(test_query)\n",
    "    print(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "398c1ecc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>conferenceName</th>\n",
       "      <th>score</th>\n",
       "      <th>counted</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Second International Conference On Research In...</td>\n",
       "      <td>0.188</td>\n",
       "      <td>47</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>11Th International Symposium Advances In Artif...</td>\n",
       "      <td>0.188</td>\n",
       "      <td>30</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>10Th International Symposium Advances In Artif...</td>\n",
       "      <td>0.186</td>\n",
       "      <td>28</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>International Conference On Research In Manage...</td>\n",
       "      <td>0.185</td>\n",
       "      <td>29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>14Th International Workshop On Computational O...</td>\n",
       "      <td>0.179</td>\n",
       "      <td>26</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                      conferenceName  score  counted\n",
       "0  Second International Conference On Research In...  0.188       47\n",
       "1  11Th International Symposium Advances In Artif...  0.188       30\n",
       "2  10Th International Symposium Advances In Artif...  0.186       28\n",
       "3  International Conference On Research In Manage...  0.185       29\n",
       "4  14Th International Workshop On Computational O...  0.179       26"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d66ea023",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "dense-kg-vector-db",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.14.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
